export type PhotoItem = {
  src: string;
  alt: string;
};

export const photoList: PhotoItem[] = [
  { src: '/wa/wa_01.jpg', alt: '和室で新郎と新婦がお辞儀をしている写真' },
  {
    src: '/wa/wa_02.jpg',
    alt: '和室で新郎と新婦が扇子を口元に当てて口を隠している写真',
  },
  { src: '/wa/wa_03.jpg', alt: '和室で新郎が新婦に膝枕してもらっている写真' },
  {
    src: '/wa/wa_04.jpg',
    alt: '縁側で新郎と新婦が並び、ふたりとも振り向いてこちらを見ている写真',
  },
  { src: '/wa/wa_05.jpg', alt: '縁側で新郎と新婦が並び、紅葉を眺めている写真' },
  { src: '/wa/wa_06.jpg', alt: '新郎と新婦が池の淵で手を繋いでいる写真' },
  { src: '/wa/wa_07.jpg', alt: '新郎と新婦が手を繋いでいる写真' },
  {
    src: '/wa/wa_08.jpg',
    alt: '新郎と新婦が手を繋いでおり、庭園の道端で新婦が振り向いている写真',
  },
  {
    src: '/wa/wa_09.jpg',
    alt: '新郎と新婦が手を繋いでおり、庭園の道端でふたりとも振り向いている写真',
  },
  { src: '/wa/wa_10.jpg', alt: '新郎と新婦が庭園の道端でこちらを見ている写真' },
  { src: '/wa/wa_11.jpg', alt: '新郎と新婦が手を繋いでいる写真' },
  { src: '/wa/wa_12.jpg', alt: '新郎と新婦が和傘をさしてこちらを見ている写真' },
  {
    src: '/wa/wa_13.jpg',
    alt: '新郎と新婦が和傘をさしてお互いを見つめ合っている写真',
  },
  {
    src: '/wa/wa_14.jpg',
    alt: '新郎と新婦が 結婚しました と書いてあるガーランドを持っている写真',
  },
  { src: '/wa/wa_15.jpg', alt: '新郎と新婦が手遊びをしている写真' },
  { src: '/wa/wa_16.jpg', alt: '新郎と新婦が寿の形をした紐を持っている写真' },
  {
    src: '/wa/wa_17.jpg',
    alt: '新郎と新婦がマイルドヤンキーポーズをとっている写真',
  },
  { src: '/wa/wa_18.jpg', alt: '新郎と新婦がおでこを合わせている写真' },
  {
    src: '/wa/wa_19.jpg',
    alt: '新婦が新郎の頬をペチンと叩き、新郎がいーっとした顔をしている写真',
  },
  { src: '/wa/wa_20.jpg', alt: '新郎が新婦の手の甲にキスをしている写真' },
  {
    src: '/wa/wa_21.jpg',
    alt: '新郎と新婦が 結婚しました と書いてあるガーランドを持って座っている写真',
  },
  {
    src: '/wa/wa_22.jpg',
    alt: '新郎と新婦が本棚の本を読んでおり、新婦の本の一部を新郎が指さしている写真',
  },
  {
    src: '/wa/wa_23.jpg',
    alt: '新郎と新婦が蝶々結びしている紐を持っている写真',
  },
  {
    src: '/wa/wa_24.jpg',
    alt: '新郎と新婦が蝶々結びしている紐を引っ張り合っている写真',
  },
  {
    src: '/wa/wa_25.jpg',
    alt: '新郎と新婦が蝶々結びしている紐を引っ張り合って、新郎がすごい顔をしている写真',
  },
  {
    src: '/yo/yo_01.jpg',
    alt: '新郎が新婦のブライダルグローブの紐を結んでいる写真',
  },
  { src: '/yo/yo_02.jpg', alt: '新郎と新婦がチャペルでにこやかにしている写真' },
  {
    src: '/yo/yo_03.jpg',
    alt: '新郎と新婦がチャペルでお互いを見つめ合っている写真',
  },
  { src: '/yo/yo_04.jpg', alt: '新郎と新婦がチャペルで自撮りをしている写真' },
  {
    src: '/yo/yo_05.jpg',
    alt: '新郎と新婦がチャペルで寝転がって上を向いている写真',
  },
  { src: '/yo/yo_06.jpg', alt: '新郎が新婦をエスコートしている写真' },
  { src: '/yo/yo_07.jpg', alt: '新郎と新婦が桜の下でにこやかにしている写真' },
  { src: '/yo/yo_08.jpg', alt: '新郎と新婦が桜の中でにこやかにしている写真' },
  { src: '/yo/yo_09.jpg', alt: '新婦が桜の中でにこやかにしている写真' },
  { src: '/yo/yo_10.jpg', alt: '新郎が桜の中ですごい顔をしている写真' },
  { src: '/yo/yo_11.jpg', alt: '新郎と新婦が桜の下で見つめ合っている写真' },
  {
    src: '/yo/yo_12.jpg',
    alt: '新郎が新婦を桜の下で引っ張って持ち上げようとしている写真',
  },
  { src: '/yo/yo_13.jpg', alt: '新郎が新婦の写真を取ってあげているような写真' },
  {
    src: '/yo/yo_14.jpg',
    alt: '新郎が新婦の写真を取ってあげているようで、実は新郎自身の自撮りをしていたというオチの写真',
  },
  {
    src: '/yo/yo_15.jpg',
    alt: '新郎と新婦が桜の下に立っており、新婦がこちらを振り向いている写真',
  },
  {
    src: '/yo/yo_16.jpg',
    alt: '新郎と新婦が木の下でベールを被ってお互いを見つめ合っている写真',
  },
  { src: '/yo/yo_17.jpg', alt: '新郎が桜の下で新婦を抱きかかえている写真' },
  {
    src: '/yo/yo_18.jpg',
    alt: '新郎が桜の下で新婦を抱きかかえて見つめ合っている写真',
  },
  {
    src: '/yo/yo_19.jpg',
    alt: '実は新郎は新婦を抱きかかえているのではなく、椅子の上に立っている新婦を抱きかかえているようなポーズを取っていました、というオチの写真',
  },
  {
    src: '/yo/yo_20.jpg',
    alt: '新郎と新婦が LOVE と書かれたバルーンを持っている写真',
  },
  { src: '/yo/yo_21.jpg', alt: '新郎と新婦が桜の下に手を掲げている写真' },
  { src: '/yo/yo_22.jpg', alt: '新郎と新婦が桜の下で手を合わせている写真' },
  {
    src: '/yo/yo_23.jpg',
    alt: '新婦が LOVE と書かれたバルーンを首に巻いている写真',
  },
  {
    src: '/yo/yo_24.jpg',
    alt: '新郎と新婦が JUST MARRIED と書かれたホオジロバナーを持っている写真',
  },
  {
    src: '/yo/yo_25.jpg',
    alt: '新郎と新婦がタキシードとウェディングドレスで桜まつりの屋台通りを練り歩いている写真',
  },
  {
    src: '/yo/yo_26.jpg',
    alt: '新郎と新婦がタキシードとウェディングドレスで屋台に並んでいる写真',
  },
  { src: '/yo/yo_27.jpg', alt: '新郎が新婦を抱きしめている写真' },
  { src: '/yo/yo_28.jpg', alt: '新郎が新婦の顔を変顔にしている写真' },
  {
    src: '/yo/yo_29.jpg',
    alt: '新婦が新郎に変顔をされたのにムカついてグーパンしている写真',
  },
  {
    src: '/yo/yo_30.jpg',
    alt: '新郎と新婦が赤い風船を持って顔を隠している写真',
  },
  {
    src: '/yo/yo_31.jpg',
    alt: '新郎と新婦が LOVE と書かれたバルーンを掲げている写真',
  },
  {
    src: '/yo/yo_32.jpg',
    alt: '新郎と新婦が本棚の本を読みながら、ふたりとも顎に指をおいている写真',
  },
  {
    src: '/yo/yo_33.jpg',
    alt: '新郎と新婦が赤いハートのバルーンを跳ね合ってる写真',
  },
];
